zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F82xxx/MC56F82738/codewarrior/MC56F82738_Vectors.c
/* Double weak ISR mechanism for CAN_ERROR to facilitate SDK usage. */

/* User could redefine ivINT_CAN_ERROR.
Please be noted that ivINT_CAN_ERROR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_ERROR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_ERROR(void);
__attribute__((weak)) void ivINT_CAN_ERROR(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_TX_WARN **********************/
/* Double weak ISR mechanism for CAN_TX_WARN to facilitate SDK usage. */

/* User could redefine ivINT_CAN_TX_WARN.
Please be noted that ivINT_CAN_TX_WARN can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_TX_WARN definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_TX_WARN(void);
__attribute__((weak)) void ivINT_CAN_TX_WARN(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_RX_WARN **********************/
/* Double weak ISR mechanism for CAN_RX_WARN to facilitate SDK usage. */

/* User could redefine ivINT_CAN_RX_WARN.
Please be noted that ivINT_CAN_RX_WARN can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_RX_WARN definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_RX_WARN(void);
__attribute__((weak)) void ivINT_CAN_RX_WARN(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for CAN_WAKEUP **********************/
/* Double weak ISR mechanism for CAN_WAKEUP to facilitate SDK usage. */

/* User could redefine ivINT_CAN_WAKEUP.
Please be noted that ivINT_CAN_WAKEUP can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_CAN_WAKEUP definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_CAN_WAKEUP(void);
__attribute__((weak)) void ivINT_CAN_WAKEUP(void)
{
    CAN0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI1_RERR **********************/
/* Double weak ISR mechanism for QSCI1_RERR to facilitate SDK usage. */

/* User could redefine the QSCI1_RERR_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI1_RERR_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI1_RERR.
Please be noted that ivINT_QSCI1_RERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI1_RERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI1_RERR(void);
__attribute__((weak)) void ivINT_QSCI1_RERR(void)
{
    QSCI1_RERR_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI1_RCV **********************/
/* Double weak ISR mechanism for QSCI1_RCV to facilitate SDK usage. */

/* User could redefine the QSCI1_RCV_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI1_RCV_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI1_RCV.
Please be noted that ivINT_QSCI1_RCV can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI1_RCV definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI1_RCV(void);
__attribute__((weak)) void ivINT_QSCI1_RCV(void)
{
    QSCI1_RCV_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI1_TIDLE **********************/
/* Double weak ISR mechanism for QSCI1_TIDLE to facilitate SDK usage. */

/* User could redefine the QSCI1_TIDLE_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI1_TIDLE_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI1_TIDLE.
Please be noted that ivINT_QSCI1_TIDLE can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI1_TIDLE definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI1_TIDLE(void);
__attribute__((weak)) void ivINT_QSCI1_TIDLE(void)
{
    QSCI1_TIDLE_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI1_TDRE **********************/
/* Double weak ISR mechanism for QSCI1_TDRE to facilitate SDK usage. */

/* User could redefine the QSCI1_TDRE_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI1_TDRE_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI1_TDRE.
Please be noted that ivINT_QSCI1_TDRE can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI1_TDRE definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI1_TDRE(void);
__attribute__((weak)) void ivINT_QSCI1_TDRE(void)
{
    QSCI1_TDRE_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI0_RERR **********************/
/* Double weak ISR mechanism for QSCI0_RERR to facilitate SDK usage. */

/* User could redefine the QSCI0_RERR_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI0_RERR_DriverIRQHandler(void)
{
    default_interrupt();
}

/* User could redefine ivINT_QSCI0_RERR.
Please be noted that ivINT_QSCI0_RERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_QSCI0_RERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_QSCI0_RERR(void);
__attribute__((weak)) void ivINT_QSCI0_RERR(void)
{
    QSCI0_RERR_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for QSCI0_RCV **********************/
/* Double weak ISR mechanism for QSCI0_RCV to facilitate SDK usage. */

/* User could redefine the QSCI0_RCV_DriverIRQHandler as normal function to implement their own ISR. */
__attribute__((weak)) static void QSCI0_RCV_DriverIRQHandler(void)
{
    default_interrupt();
}

